---
kind: method
id: M:Autodesk.Revit.DB.Macros.IEntryPoint.Initialize(System.Object,System.String)
source: html/7619b903-34aa-32d1-38d9-f7e826828a5f.htm
---
# Autodesk.Revit.DB.Macros.IEntryPoint.Initialize Method

## Syntax (C#)
```csharp
void Initialize(
	Object obj,
	string addinFolder
)
```

## Parameters
- **obj** (`System.Object`)
- **addinFolder** (`System.String`)